export interface CriticismMethod {
  title: string;
  shortDescription: string;
  description: string[];
}

export const criticismMethods: CriticismMethod[] = [
  {
    title: 'Шаг первый. Эмпатия',
    shortDescription: 'Слушайте критикующего и постарайтесь понять его точку зрения, задавая конкретные вопросы.',
    description: [
      'Когда кто-то критикует вас, не концентрируйтесь сразу на нюансах. Задайте конкретные вопросы, чтобы выяснить, что именно человек имеет в виду.',
      'Избегайте осуждающего или оборонительного тона. Просите больше конкретной информации и постарайтесь увидеть ситуацию глазами критикующего.',
      'Если человек нападает на вас, навешивая оскорбительные ярлыки, попросите его быть конкретнее и указать, что именно ему в вас не нравится.',
      'Этот первый шаг поможет перейти от взаимодействия по принципу «защита и нападение» к сотрудничеству и взаимному уважению.'
    ],
  },
  {
    title: 'Шаг второй. Разоружение оппонента',
    shortDescription: 'Независимо от того, прав критик или нет, найдите способ согласиться с ним или с ней.',
    description: [
      'Когда в вас "стреляют" критикой, вы можете: 1) выстрелить в ответ (ведет к конфликту); 2) убежать (ведет к потере самоуважения); 3) разоружить противника, что является самым удачным вариантом.',
      'Чтобы разоружить критика, найдите способ согласиться с ним. Если критика справедлива — прямо признайте это. Если нет — согласитесь с критикой в принципе или найдите зерно правды в сказанном.',
      'Важно избегать сарказма и оборонительной манеры речи. Когда вы соглашаетесь с собеседником, у него заканчиваются "боеприпасы" и он чувствует себя услышанным.',
      'Глубокое желание защищаться — это ОГРОМНАЯ ошибка! Каждый раз, пытаясь защититься, вы непроизвольно пополняете арсенал противника. Оборонительная позиция обычно приводит к провалу коммуникации.'
    ],
  },
  {
    title: 'Шаг третий. Обратная связь и переговоры',
    shortDescription: 'После эмпатии и разоружения, выскажите свою точку зрения решительно и тактично.',
    description: [
      'После того как вы выслушали критика и нашли способ согласиться, вы можете объяснить свою позицию и преодолеть разногласия.',
      'Даже если оппонент абсолютно неправ, выразите свою точку зрения объективно, признавая возможность того, что неправы. Сведите конфликт к фактам, а не к ущемленной гордости.',
      'Если разногласия касаются вопросов вкуса или предпочтений, выскажите свою точку зрения тактично, признавая право другого человека на свое мнение.',
      'Если вы явно неправы, согласитесь с критикой, поблагодарите человека и извинитесь. Это повысит уважение к вам со стороны собеседника.'
    ],
  },
  {
    title: 'Техника общения с теми, кто любит перебивать',
    shortDescription: 'Используйте специальную технику для работы с навязчивыми и осуждающими вопросами.',
    description: [
      'Эта техника особенно полезна при публичных выступлениях, лекциях или преподавании, когда вас перебивают агрессивными или неуместными вопросами.',
      'Метод включает три шага: 1) Немедленно поблагодарить человека за замечания; 2) Признать, что поднятые вопросы важны; 3) Сделать акцент на необходимости получения дополнительных данных.',
      'В заключение пригласите оппонента продолжить обсуждение его идей после основного мероприятия. Это позволит утихомирить нарушителя спокойствия, не обидев его.',
      'Этот жизнеутверждающий подход чаще всего дает положительный результат. Порой именно такие "нарушители спокойствия" становятся самыми благодарными слушателями.'
    ],
  },
]; 
